; domain
(define (domain blocksworld-4ops)
  (:requirements :strips)
  (:predicates
    (clear ?x)
    (on-table ?x)
    (arm-empty)
    (holding ?x)
    (on ?x ?y)
  )

  (:action pickup
    :parameters (?ob)
    :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
    :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
      (not (arm-empty)))
  )

  (:action putdown
    :parameters (?ob)
    :precondition (holding ?ob)
    :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
      (not (holding ?ob)))
  )

  (:action stack
    :parameters (?ob ?underob)
    :precondition (and (clear ?underob) (holding ?ob))
    :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
      (not (clear ?underob)) (not (holding ?ob)))
  )

  (:action unstack
    :parameters (?ob ?underob)
    :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
    :effect (and (holding ?ob) (clear ?underob)
      (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))
  )
)

; problem
(define (problem BW-rand-22)
(:domain blocksworld-4ops)
(:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 )
(:init
(arm-empty)
(on b1 b5)
(on b2 b20)
(on-table b3)
(on b4 b2)
(on b5 b16)
(on b6 b12)
(on-table b7)
(on b8 b7)
(on-table b9)
(on-table b10)
(on b11 b4)
(on b12 b13)
(on b13 b1)
(on b14 b9)
(on b15 b14)
(on b16 b22)
(on-table b17)
(on b18 b8)
(on b19 b3)
(on b20 b15)
(on b21 b6)
(on-table b22)
(clear b10)
(clear b11)
(clear b17)
(clear b18)
(clear b19)
(clear b21)
)
(:goal
(and
(on b1 b6)
(on b2 b20)
(on b3 b21)
(on b4 b10)
(on b5 b1)
(on b6 b12)
(on b7 b4)
(on b9 b7)
(on b12 b11)
(on b13 b22)
(on b14 b17)
(on b15 b13)
(on b16 b19)
(on b17 b8)
(on b18 b15)
(on b19 b3)
(on b20 b18)
(on b21 b9))
)
)

; plan
1. (unstack b19 b3)
   deleted: (on b19 b3) (clear b19) (arm-empty)
   added: (holding b19) (clear b3)
   goals met: 2 of 18
2. (putdown b19)
   deleted: (holding b19)
   added: (clear b19) (arm-empty) (on-table b19)
   goals met: 2 of 18
3. (unstack b18 b8)
   deleted: (on b18 b8) (clear b18) (arm-empty)
   added: (holding b18) (clear b8)
   goals met: 2 of 18
4. (putdown b18)
   deleted: (holding b18)
   added: (clear b18) (arm-empty) (on-table b18)
   goals met: 2 of 18
5. (unstack b8 b7)
   deleted: (on b8 b7) (clear b8) (arm-empty)
   added: (holding b8) (clear b7)
   goals met: 2 of 18
6. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 2 of 18
7. (unstack b11 b4)
   deleted: (on b11 b4) (clear b11) (arm-empty)
   added: (holding b11) (clear b4)
   goals met: 2 of 18
8. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 2 of 18
9. (unstack b4 b2)
   deleted: (on b4 b2) (clear b4) (arm-empty)
   added: (holding b4) (clear b2)
   goals met: 2 of 18
10. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 2 of 18
11. (unstack b2 b20)
   deleted: (on b2 b20) (clear b2) (arm-empty)
   added: (holding b2) (clear b20)
   goals met: 1 of 18
12. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 1 of 18
13. (unstack b20 b15)
   deleted: (on b20 b15) (clear b20) (arm-empty)
   added: (holding b20) (clear b15)
   goals met: 1 of 18
14. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 1 of 18
15. (unstack b15 b14)
   deleted: (on b15 b14) (clear b15) (arm-empty)
   added: (holding b15) (clear b14)
   goals met: 1 of 18
16. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 1 of 18
17. (unstack b14 b9)
   deleted: (on b14 b9) (clear b14) (arm-empty)
   added: (holding b14) (clear b9)
   goals met: 1 of 18
18. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 1 of 18
19. (unstack b21 b6)
   deleted: (on b21 b6) (clear b21) (arm-empty)
   added: (holding b21) (clear b6)
   goals met: 1 of 18
20. (putdown b21)
   deleted: (holding b21)
   added: (clear b21) (arm-empty) (on-table b21)
   goals met: 1 of 18
21. (unstack b6 b12)
   deleted: (on b6 b12) (clear b6) (arm-empty)
   added: (holding b6) (clear b12)
   goals met: 0 of 18
22. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 0 of 18
23. (unstack b12 b13)
   deleted: (on b12 b13) (clear b12) (arm-empty)
   added: (holding b12) (clear b13)
   goals met: 0 of 18
24. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 0 of 18
25. (unstack b13 b1)
   deleted: (on b13 b1) (clear b13) (arm-empty)
   added: (holding b13) (clear b1)
   goals met: 0 of 18
26. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 0 of 18
27. (unstack b1 b5)
   deleted: (on b1 b5) (clear b1) (arm-empty)
   added: (holding b1) (clear b5)
   goals met: 0 of 18
28. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 0 of 18
29. (unstack b5 b16)
   deleted: (on b5 b16) (clear b5) (arm-empty)
   added: (holding b5) (clear b16)
   goals met: 0 of 18
30. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 0 of 18
31. (unstack b16 b22)
   deleted: (on b16 b22) (clear b16) (arm-empty)
   added: (holding b16) (clear b22)
   goals met: 0 of 18
32. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 0 of 18
33. (pickup b17)
   deleted: (clear b17) (on-table b17) (arm-empty)
   added: (holding b17)
   goals met: 0 of 18
34. (stack b17 b8)
   deleted: (clear b8) (holding b17)
   added: (arm-empty) (clear b17) (on b17 b8)
   goals met: 1 of 18
35. (pickup b14)
   deleted: (clear b14) (on-table b14) (arm-empty)
   added: (holding b14)
   goals met: 1 of 18
36. (stack b14 b17)
   deleted: (clear b17) (holding b14)
   added: (arm-empty) (clear b14) (on b14 b17)
   goals met: 2 of 18
37. (pickup b13)
   deleted: (clear b13) (on-table b13) (arm-empty)
   added: (holding b13)
   goals met: 2 of 18
38. (stack b13 b22)
   deleted: (clear b22) (holding b13)
   added: (arm-empty) (clear b13) (on b13 b22)
   goals met: 3 of 18
39. (pickup b15)
   deleted: (clear b15) (on-table b15) (arm-empty)
   added: (holding b15)
   goals met: 3 of 18
40. (stack b15 b13)
   deleted: (clear b13) (holding b15)
   added: (arm-empty) (clear b15) (on b15 b13)
   goals met: 4 of 18
41. (pickup b18)
   deleted: (clear b18) (on-table b18) (arm-empty)
   added: (holding b18)
   goals met: 4 of 18
42. (stack b18 b15)
   deleted: (clear b15) (holding b18)
   added: (arm-empty) (clear b18) (on b18 b15)
   goals met: 5 of 18
43. (pickup b20)
   deleted: (clear b20) (on-table b20) (arm-empty)
   added: (holding b20)
   goals met: 5 of 18
44. (stack b20 b18)
   deleted: (clear b18) (holding b20)
   added: (arm-empty) (clear b20) (on b20 b18)
   goals met: 6 of 18
45. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 6 of 18
46. (stack b2 b20)
   deleted: (clear b20) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b20)
   goals met: 7 of 18
47. (pickup b12)
   deleted: (clear b12) (on-table b12) (arm-empty)
   added: (holding b12)
   goals met: 7 of 18
48. (stack b12 b11)
   deleted: (clear b11) (holding b12)
   added: (arm-empty) (clear b12) (on b12 b11)
   goals met: 8 of 18
49. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 8 of 18
50. (stack b6 b12)
   deleted: (clear b12) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b12)
   goals met: 9 of 18
51. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 9 of 18
52. (stack b1 b6)
   deleted: (clear b6) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b6)
   goals met: 10 of 18
53. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 10 of 18
54. (stack b5 b1)
   deleted: (clear b1) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b1)
   goals met: 11 of 18
55. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 11 of 18
56. (stack b4 b10)
   deleted: (clear b10) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b10)
   goals met: 12 of 18
57. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 12 of 18
58. (stack b7 b4)
   deleted: (clear b4) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b4)
   goals met: 13 of 18
59. (pickup b9)
   deleted: (clear b9) (on-table b9) (arm-empty)
   added: (holding b9)
   goals met: 13 of 18
60. (stack b9 b7)
   deleted: (clear b7) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b7)
   goals met: 14 of 18
61. (pickup b21)
   deleted: (clear b21) (on-table b21) (arm-empty)
   added: (holding b21)
   goals met: 14 of 18
62. (stack b21 b9)
   deleted: (clear b9) (holding b21)
   added: (arm-empty) (clear b21) (on b21 b9)
   goals met: 15 of 18
63. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 15 of 18
64. (stack b3 b21)
   deleted: (clear b21) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b21)
   goals met: 16 of 18
65. (pickup b19)
   deleted: (clear b19) (on-table b19) (arm-empty)
   added: (holding b19)
   goals met: 16 of 18
66. (stack b19 b3)
   deleted: (clear b3) (holding b19)
   added: (arm-empty) (clear b19) (on b19 b3)
   goals met: 17 of 18
67. (pickup b16)
   deleted: (clear b16) (on-table b16) (arm-empty)
   added: (holding b16)
   goals met: 17 of 18
68. (stack b16 b19)
   deleted: (clear b19) (holding b16)
   added: (arm-empty) (clear b16) (on b16 b19)
   goals met: 18 of 18
